/**
 * <p>Второй уровень абстракций. Желания человека. Проводя аналогию с книгой это краткое описание главы.</p>
 * <p>С логической точки зрения тут описываются желания человека относительно данного продукта, бизнесс процесс.
 * Подробность описания определяется исключительно удобством последующей обработки отчёта.</p>
 * <p>С технической точки зрения - это начало теста. Здесь выбирается (параметрический или обычный) и
 * запускается junit, в первый раз появляется возможность определить драйвер, шаги.</p>
 * <p>После того, как человек определился со своими намерениями, он выполняет конкретные действия - пакет steps</p>
 */
package com.icanbuy.cases;